[
  {
    "name": "Alicorn",
    "url": "https://www.rocketpunch.com/",
    "position": "백엔드 개발자",
    "started_at": "2021년 6월",
    "ended_at": "2023년 4월",
    "total_summary": "Python Django 기반 백엔드 서버 개발 및 CI/CD 개선, React 기반 프론트엔드 구축",
    "tasks": [
      {
        "summary": "Python 백엔드 서버 개발",
        "desc": [
          "Django와 Graphene 등을 사용하여 GraphQL API 등의 여러가지 방법으로 제공되는 서비스에 신규 기능이나 기능 개선을 진행하였습니다.",
          "Django의 major version, Python의 minor version 업그레이드 등의 작업을 실서비스에 중단시간 없이 진행하였습니다.",
          "사용자 계정 보안 정책 개발에 참여하여 사용자의 계정 안전성을 증진시켰습니다.",
          "악의적 접근자로부터의 부적절한 요청을 차단하기 위한 방어 로직을 개발하였습니다.",
          "Python 코드에 Type Annotation을 추가하고, pre-commit hook과 flake8, black을 도입하는 등 여러가지 개발환경과 코드품질 개선 작업을 진행하였습니다.",
          "사용자들이 입력해놓은 수만가지의 전문분야 키워드들을 분석하여 중복되거나 잘못 입력된 키워드를 교정하는 로직을 개발하였습니다.",
          "Universal Analytics의 서비스 종료에 대비하여 Google Analytics 4 전환 프로젝트를 진행하였습니다.",
          "기존 사이트와 React로 재작성된 페이지를 중간 연결하는 부분의 결합 코드를 개발하였습니다."
        ],
        "keywords": ["Python", "Django", "Graphene", "GraphQL", "pre-commit", "flake8", "black"]
      },
      {
        "summary": "CI/CD 개발",
        "desc": [
          "CircleCI에서 실행되는 pytest 기반 테스트 코드를 최적화하여 실행시간을 12% 이상 감소시켰습니다.",
          "pytest 기반 테스트 코드에서 테스트 실패시 출력되는 메시지를 보다 인간 친화적인 메시지로 수정하여 디버깅이 수월하도록 변경했습니다.",
          "pytest 기반 테스트 코드 작성에 반복적으로 필요한 준비 코드들을 내재화하여 테스트 코드 라인 수를 10% 이상 감소시켜 작성과 리뷰를 보다 손쉽게 변경하였습니다.",
          "실 서비스에 사용되는 Docker image의 크기를 10%가량 감소시켰습니다.",
          "로컬에 백엔드 개발환경을 구축할 수 있도록 개발용 Docker image와 Docker Compose 설정을 재작성하여 백엔드 개발 지식이 없어도 로컬에서 개발용 서버를 구동할 수 있도록 만들었습니다."
        ],
        "keywords": ["CircleCI", "Docker", "Docker Compose", "AWS Codepipeline"]
      },
      {
        "summary": "React 기반 프론트엔드 개발",
        "desc": [
          "집무실 공식 사이트와 엔터프라이즈 고객용 사이트의 프론트엔드를 Next.js 기반으로 기반 구축부터 참여하였습니다.",
          "프론트엔드팀과의 협업을 위해 기존 코드 구조에 대한 설명 및 문서화, 코드 컨벤션 논의 등에 적극적으로 참여하였습니다.",
          "기존 사이트를 React로 재작성하는 프로젝트에서 다른 Framework 없이 webpack과 SWC, TailwindCSS 등을 직접 세팅하여 프로젝트를 구축하였습니다."
        ],
        "keywords": ["TypeScript", "React", "Next.js", "webpack", "SWC", "TailwindCSS", "ESLint", "Prettier"]
      },
      {
        "summary": "사내 문화 조성",
        "desc": [
          "온라인 업무 위주였기때문에, 다른 동료직원분들과 친밀감과 공감대 형성을 위해 매월 진행되는 알리콘 밥모임 제도를 제안하였습니다.",
          "동료직원분들과의 대화가 업무에만 치중되지 않도록 사담을 나눌 수 있는 대화방 신설을 제안하였습니다."
        ],
        "keywords": ["Slack"]
      }
    ]
  },
  {
    "name": "ODK Media",
    "url": "https://www.odkmedia.net",
    "position": "백엔드 개발자",
    "started_at": "2020년 4월",
    "ended_at": "2021년 2월",
    "total_summary": "Python Django 기반 백엔드 서버 개발 및 Shopify, TypeScript 등을 활용한 부가적 개발",
    "tasks": [
      {
        "summary": "Python 백엔드 서버 개발",
        "desc": [
          "운영중인 서비스와 신규 개발버전 양쪽에 Python과 Django, django-rest-framework를 활용하여 유지보수 및 기능개발에 참여했습니다.",
          "운영중인 서비스의 콘텐츠를 새로 개발될 API 서버로 이식하기 위한 마이그레이션 개발에 참여하였습니다.",
          "기존 Python 코드에 Type Annotation 추가를 권장하여 프로젝트의 IDE 친화도를 증진시켰습니다."
        ],
        "keywords": ["Python", "Django", "django-rest-framework"]
      },
      {
        "summary": "Shopify 서비스 개발",
        "desc": ["Shopify 기반 쇼핑몰의 UI 추가/개선 및 검색엔진 최적화를 진행하여 사용성을 증진시켰습니다."],
        "keywords": ["Shopify", "Liquid", "SEO"]
      },
      {
        "summary": "In-house tool 개발",
        "desc": [
          "TypeScript로 서비스 상태 모니터링 시스템을 개발 및 구축하였으며, k8s 환경에 자동배포 되도록 세팅하였습니다."
        ],
        "keywords": ["TypeScript"]
      }
    ]
  },
  {
    "name": "브랜더진",
    "url": "https://www.brandazine.kr",
    "position": "백엔드 개발자",
    "started_at": "2018년 4월",
    "ended_at": "2019년 7월",
    "total_summary": "Python Django 기반 백엔드 서버 개발부터 AWS 환경으로의 배포, Vue.js와 TypeScript 기반 수정 등등",
    "tasks": [
      {
        "summary": "Python 백엔드 서버 개발",
        "desc": [
          "초기 Django로만 작성된 코드를 DRF를 이용하여 상당부분 리팩토링하였습니다.",
          "실서버 배포시의 위험 방지를 위해 백엔드 구동환경을 Docker로 제한하고, QA용 베타 서버 시스템을 도입하였습니다.",
          "프론트엔드 개발자와의 원활한 의사소통을 위해 drf-yasg를 이용한 Swagger문서를 자동 생성하여 협업하였습니다.",
          "오작동하던 가상계좌 결제를 리팩토링하여 정상화시키고 보안 결함을 점검하였으며 물류 공급처와의 정산시스템을 확립하였습니다.",
          "기존 파일 첨부 시스템이 대응하지 못하였던 HEIC 타입 이미지를 지원하도록 수정하였습니다.",
          "서비스의 핵심 기능인 인플루언서 시스템과 Look 등의 인플루언서 기반 서비스가 가능하도록 백엔드 API를 개발하여 실서비스에 도입하였습니다.",
          "Curation, Banner등의 기능을 개발하여 보다 여러가지 방법으로 상품을 소개할 수 있도록 백엔드 API를 개발하여 실서비스에 도입하였습니다.",
          "보다 다양한 마케팅 전략을 지원하기 위하여 할인행사 기능, 쿠폰기능, 인플루언서 연동 기능을 개발하여 실서비스에 도입하였습니다.",
          "고객들의 편의성을 위하여 관련상품 및 추천상품 기능이 개발되었고, 목록에서의 상품 필터 및 정렬 기능, 키워드 기반 검색 기능을 개발하여 실서비스에 도입하였습니다.",
          "보다 나은 정보 제공을 위해 고객, 브랜드, 회사 운영진들에게 카카오 알림톡이나 Slack 메시지를 보내서 관리의 편의성을 도모하는 기능을 실서비스에 도입하였습니다.",
          "실 접속자 증가에 따른 서버 부하를 분산하기 위해 인스턴스 업스케일과 Elasticache를 도입하였습니다.",
          "프론트엔드 개발 공수가 부족한 상황에서는 Vue.js와 TypeScript를 이용하여 서비스 개선에 참여했습니다."
        ],
        "keywords": ["Python", "Django", "django-rest-framework", "AWS", "Docker", "CircleCI", "TypeScript", "Vue.js"]
      }
    ]
  },
  {
    "name": "XS Inc.",
    "url": "http://www.xsinc.co.kr/",
    "position": "웹 개발 인턴",
    "started_at": "2014년 12월",
    "ended_at": "2015년 1월",
    "total_summary": "Python Django 기반 백엔드 서버 개발 등등",
    "tasks": [
      {
        "summary": "Python 백엔드 서버 개발",
        "desc": [
          "인터넷카페 관련 프로그램의 내부 배포 관리 시스템, Ready-APP을 WSGI 서버와 nginx를 이용하여 안정화시켰습니다.",
          "내부 관리 시스템인 ReadyBoot의 관리자 인터페이스를 개선하였습니다.",
          "내부 인증 서버의 보안성을 향상시키고 관리 기능을 추가하였습니다."
        ],
        "keywords": ["Python", "Django", "NGINX", "WSGI"]
      }
    ]
  },
  {
    "name": "비즈원",
    "url": "http://www.bizzwon.com/",
    "position": "웹 개발자",
    "started_at": "2012년 11월",
    "ended_at": "2014년 1월",
    "total_summary": "jQuery나 PHP등을 활용한 웹 사이트 용역 개발",
    "tasks": [
      {
        "summary": "웹사이트 개발",
        "desc": [
          "웹에이전시 사내 솔루션용 일정관리 프로그램 및 웹앱용 페이지, 사내 내부용 전자결재 솔루션을 개발하여 사내 행정 및 고객용 서비스에 접목시켰습니다.",
          "쇼핑몰 솔루션의 가격 연산부를 수정하고 보안 취약점 수정 등의 작업을 하여 자체 쇼핑몰 솔루션의 내부 구조를 개선하였습니다.",
          "기존 사내 솔루션의 SMS 연동 부분을 개량하고 쏜다넷, 가비아의 SMS 기능을 사내 솔루션과 연동하여 자체 솔루션에서 보다 많은 SMS 벤더를 지원할 수 있게 되었습니다.",
          "그 외에도 이미지링크(특수형태의 쇼핑몰 개발), 세마스포츠마케팅, 오앤오컨설팅 등 여러 사이트의 개발에 참여하였습니다."
        ],
        "keywords": ["PHP", "JavaScirpt", "jQuery"]
      }
    ]
  }
]
